/**
 * 菲波那契数列类型题目套路
 * 
 * 
 */

/**
 * 加入牧场可以控制母牛的生产数量和生产性别
 * 每年可以生产一次
 * 每次生产只会生产一只小母牛
 * 小母牛经过三年成长才可以再生产小小母牛
 * 生产规则同母牛一样
 * 请问N年后可以收获多少只母牛
 * (忽略母牛死亡情况，假设母牛不会死)
 */

/**
 * 加入兔子场的兔子
 * 一年生产一次
 * 每次可以生产2只兔子
 * 小兔子经过2年后可以生产小小兔子
 * 请问N年后还可以收获多少只兔子
 * (忽略兔子死亡，假设兔子不会死)
 * 
 */

/**
 * 字符串中只有0和1两种字符
 * 如果一个字符串中只要是出现0的位置，左边就靠着1，这样的字符串叫做达标字符串
 * 给定一个正数N，返回所以的长度为N的字符串中，达标字符串的数量
 * 比如N = 3，返回3，只有'101','110','111' 达标
 * 
 */

/**
 * 现有N根木棍，第i根木棍的长度为i
 * 请问至少要去掉多少根木棍才能使得剩下的木棍无法组成三角形？
 * 
 */

/**
 * 假设背包容量为w
 * 现有N带零食，第i带零食体积为v[i]
 * 请问在不超过背包容量的情况下，一共有多少可以放粮食的方法
 * 
 */

/**
 * 现在有一个描述工作情况的池子，每项工作包括该工作需要的难度和报酬、
 * job: [{hard: 20, money: 15}]
 * 现在有N个人需要找工作，arr[i]代表第i个人的工作能力
 * 工作能力大于等于工作难度才可以胜任工作
 * 每个人要能拿到尽可能多的报酬
 * 请问这个N个人最终可以拿到的报酬可以是多少？
 * 
 * 输入job,arr，返回N个人最高报酬集合
 * 
 */

 /**
  * 给定一个字符串，如果一个字符串符合人们日常书写一个整数的形式，
  * 返回数字类型的这个数，如果不符合，返回-1 或者报错
  */