/**
 * 哈希函数
 */

/**
 * 哈希表
 */

/**
 * 布隆过滤器
 */

/**
 * 什么是一致性哈希/一致性哈希原理
 * 
 */

//应用：并查集

/**
 * 设计RandomPool结构
 * 【题目】
 * 设计一种结构，在该结构中有如下三个功能
 * insert(key) 将某个key加入到该结构，做到不重复加入
 * delete(key) 将原本在结构中的某个key移除
 * getRandom() 等概率随机返回机构中的任何一个key
 * 
 * 要求：以上三个方法的时间复杂度都是O(1)
 */


/**
 * 岛问题
 * 【题目】
 * 一个矩阵中只有0和1 两种值，每个位置都可以和自己的上下左右4个位置相连，
 * 如果有1片1连在一起，这个部分叫做一个岛，
 * 求一个矩阵中有多少个岛？
 * 
 * 例如
 * 001010
 * 111010
 * 100100
 * 000000
 * 这个矩阵中有三个岛
 * 
 * 进阶：
 * 如何设计一个并行算法解决这个问题
 * 
 */
